using System;
using System.Collections.Generic;
using System.Text;

namespace DistrictSupplySolution.DbnTables
{
    class CoefficientsOfMembershipInMaximum
    {
        public double[,] CoefficientsOfMaximum { get; set; }

        public CoefficientsOfMembershipInMaximum()
        {
            CoefficientsOfMaximum = new double[,]
            {
                // Житловы будинки з електроплитами
                {1, 0.9 , 0.6, 0.7, 0.6, 0.4, 0.6, 0.6 , 0.8, 0.7 , 0.8, 0.4, 0.7 , 0.6 , 0.7, 0.9 },
                // Житлові будинки з газовими плитами 
                {0.9, 1, 0.6, 0.7, 0.5, 0.3, 0.4, 0.5, 0.8, 0.7, 0.7, 0.4, 0.6, 0.5, 0.5, 0.9  },
                // Підприємства громадського харчування (їдальні, ресторани, кафе)
                {0.4, 0.4, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.7, 0.8, 0.8, 0.8 , 0.8, 0.8, 0.5 },
                // Школи, середні навчальні заклади, ПТУ, бібліотеки
                {0.5,   0.4,    0.8,    0.6,    0.7,    0.7,    0.8,    0.8,    0.8,    0.7,   0.8,    0.8,    0.8,    0.7,    0.8,    0.8},
                // Торгові підприємства одно-, півтора- та двозмінні
                {0.5,   0.4,    0.8,    0.6,    0.7,    0.7,    0.8,    0.8,    0.8,    0.7,    0.8,    0.8,    0.8,    0.7,    0.8,    0.8},
                // Установи адміністративного управління, фінансові, проектно-конструкторські організації
                {0.5,   0.4,    0.8,    0.8,    0.8,    0.8,    0.8,    0.8,    0.8,    0.7,    0.8,    0.8,    0.8,    0.7,    0.8,    0.5},
                // Готелі
                {0.8,   0.8,    0.6,    0.8,    0.4,    0.3,    0.6,    0.6,    0.8,    0.8,    0.8,    0.4,    0.7,    0.5,    0.7,    0.9},
                // Поліклініки 
                {0.5,   0.4,    0.8,    0.6,    0.8,    0.8,    0.8,    0.8,    0.7,    0.7,    0.8,    0.8,    0.8,    0.7,    0.8,    0.8},
                // Ательє та інші підприємства побутового обслуговування
                { 0.5,  0.4,    0.8,    0.6,    0.8,    0.8,    0.8,    0.8,    0.7,    0.7,    0.8,    0.8,    0.8,    0.7,    0.8,    0.8},
                // Культові, культурно-видовищні та дозвіллєві заклади
                {0.9,   0.9,    0.4,    0.6,    0.3,    0.2,    0.2,    0.8,    0.7,    0.7,    0.8,    0.2,    0.4,    0.4,    0.5,    1}
            };
        }

      
}

}
