using DevExpress.Mvvm;
using System;
using System.Collections.Generic;
using System.Text;
using WpfPaging.DistrictObjects;

namespace WpfPaging.DbnTables
{
    public class DbnCommercialBuildings:BindableBase
    {
        public List<DbnCommercialBuilding> CommercialBuildingsList { get; set; }
        public DbnCommercialBuildings()
        {
            // Вносить значения из дбн
            CommercialBuildingsList = new List<DbnCommercialBuilding>()
            {
            new DbnCommercialBuilding("Підприємства громадського харчування повністю електрифіковані", 500,  1.03, "кВт на місце", 0.98, 0.2),
            new DbnCommercialBuilding("Підприємства громадського харчування повністю електрифіковані", 1000, 0.85, "кВт на місце", 0.98, 0.2),
            new DbnCommercialBuilding("Підприємства громадського харчування повністю електрифіковані", 50000, 0.75, "кВт на місце", 0.98, 0.2),
            new DbnCommercialBuilding("Підприємства громадського харчування частково електрифіковані", 500, 0.8, "кВт на місце", 0.95, 0.33),
            new DbnCommercialBuilding("Підприємства громадського харчування частково електрифіковані", 1000, 0.7, "кВт на місце", 0.95, 0.33),
            new DbnCommercialBuilding("Підприємства громадського харчування частково електрифіковані", 50000, 0.6, "кВт на місце", 0.95, 0.33),
            new DbnCommercialBuilding("Підприємства роздрібної торгівлі продовольчі без кондиціонування повітря", 50000, 0.23, "кВт на м2 торгової зали", 0.85, 0.62),
            new DbnCommercialBuilding("Підприємства роздрібної торгівлі продовольчі з кондиціонуванням повітря", 50000, 0.25, "кВт на м2 торгової зали", 0.8, 0.75),
            new DbnCommercialBuilding("Підприємства роздрібної торгівлі промтоварні без кондиціонування повітря", 50000, 0.14, "кВт на м2 торгової зали", 0.85, 0.62),
            new DbnCommercialBuilding("Підприємства роздрібної торгівлі промтоварні з кондиціонуванням повітря", 50000, 0.15, "кВт на м2 торгової зали", 0.8, 0.75),
            new DbnCommercialBuilding("Підприємства роздрібної торгівлі універсами без кондиціонування повітря", 50000, 0.15, "кВт на м2 торгової зали", 0.87, 0.57),
            new DbnCommercialBuilding("Підприємства роздрібної торгівлі універсами з кондиціонуванням повітря", 50000, 0.2, "кВт на м2 торгової зали", 0.85, 0.62),
            new DbnCommercialBuilding("Загальноосвітні школи з електрифікованими їдальнями та спортзалами", 50000, 0.25, "кВт на одного учня", 0.95, 0.33),
            new DbnCommercialBuilding("Загальноосвітні школи без електрифікованих їдалень, із спортзалами", 50000, 0.17, "кВт на одного учня", 0.9, 0.48),
            new DbnCommercialBuilding("Загальноосвітні школи з буфетами, без спортзалів", 50000, 0.17, "кВт на одного учня", 0.9, 0.48),
            new DbnCommercialBuilding("Загальноосвітні школи без буфетів і спортзалів", 50000, 0.15, "кВт на одного учня", 0.9, 0.48),
            new DbnCommercialBuilding("Професіонально-технічні навчальні заклади з їдальнями", 50000, 0.45, "кВт на одного учня", 0.8, 0.75),
            new DbnCommercialBuilding("Дошкільні навчальні заклади з електрифікованими харчоблоками", 50000, 0.45, "кВт на місце", 0.98, 0.2),
            new DbnCommercialBuilding("Дошкільні навчальні заклади з газовими плитами", 50000, 0.2, "кВт на місце", 0.98, 0.2),
            new DbnCommercialBuilding("Школи-інтернати", 50000, 1.1, "кВт на місце", 0.95, 0.33), 
            new DbnCommercialBuilding("Будинки-інтернати для інвалідів та людей похилого віку", 50000, 2.2, "кВт на місце", 0.93, 0.40),
            new DbnCommercialBuilding("Заклади охорони здоров'я лікарні хірургічного профілю з електрифікованими харчоблоками", 50000, 2.5, "кВт на ліжко-місце", 0.92, 0.43),
            new DbnCommercialBuilding("Заклади охорони здоров'я хірургічні корпуси (без харчоблоків)", 50000, 0.8, "кВт на ліжко-місце", 0.95, 0.33),
            new DbnCommercialBuilding("Заклади охорони здоров'я лікарні багатопрофільні з електрифікованими харчоблоками", 50000, 2.2, "кВт на ліжко-місце", 0.93, 0.4),
            new DbnCommercialBuilding("Заклади охорони здоров'я терапевтичні корпуси (без харчоблоків)", 50000, 0.5, "кВт на ліжко-місце", 0.95, 0.33),
            new DbnCommercialBuilding("Заклади охорони здоров'я радіологічні корпуси (без харчоблоків)", 50000, 0.7, "кВт на ліжко-місце", 0.95, 0.33),
            new DbnCommercialBuilding("Заклади охорони здоров'я лікарні дитячі з електрифікованими харчоблоками", 50000, 2, "кВт на ліжко-місце", 0.93, 0.4),
            new DbnCommercialBuilding("Заклади охорони здоров'я терапевтичні корпуси дитячих лікарень (без харчоблоків)", 50000, 0.4, "кВт на ліжко-місце", 0.95, 0.33),
            new DbnCommercialBuilding("Будинки відпочинку і пансіонати без кондиціонування повітря", 50000, 0.4, "кВт на місце", 0.92, 0.43),
            new DbnCommercialBuilding("Дитячі табори", 50000, 0.03, "кВт на м2 житл. приміщ", 0.92, 0.43),
            new DbnCommercialBuilding("Поліклініки", 50000, 0.15, "кВт на відвід, за зміну", 0.92, 0.43),
            new DbnCommercialBuilding("Аптеки без приготування ліків", 50000, 0.12, "кВт на м2 торг, зали", 0.93, 0.4),
            new DbnCommercialBuilding("Аптеки з приготуванням ліків", 50000, 0.17, "кВт на м2 торг, зали", 0.9, 0.48),
            new DbnCommercialBuilding("Кінотеатри та кіноконцертні зали з кондиціонуванням повітря", 50000, 0.15, "кВт на місце", 0.92, 0.43),
            new DbnCommercialBuilding("Кінотеатри та кіноконцертні зали без кондиціонування повітря", 50000, 0.12, "кВт на місце", 0.95, 0.33),
            new DbnCommercialBuilding("Театри та цирки", 50000, 0.35, "кВт на місце", 0.90, 0.48),
            new DbnCommercialBuilding("Палаци культури, клуби", 50000, 0.45, "кВт на місце", 0.92, 0.43),
            new DbnCommercialBuilding("Готелі (без ресторанів) з кондиціонуванням повітря", 50000, 0.5, "кВт на місце", 0.85, 0.62),
            new DbnCommercialBuilding("Готелі (без ресторанів) без кондиціонування повітря", 50000, 0.35, "кВт на місце", 0.85, 0.62),
            new DbnCommercialBuilding("Фабрики хімчистки та пральні самообслуговування", 50000, 0.08, "кВт/кг речей", 0.75, 0.88),
            new DbnCommercialBuilding("Комплексні підприємства, служби побуту", 50000, 0.6, "кВт на роб. місце", 0.85, 0.62),
            new DbnCommercialBuilding("Перукарні", 50000, 1.45, "кВт на роб. місце", 0.97, 0.25),
            new DbnCommercialBuilding("Гуртожитки з електроплитами на кухнях", 50000, 0.5, "кВт на місце", 0.95, 0.33),
            new DbnCommercialBuilding("Гуртожитки без електроплит на кухнях", 50000, 0.2, "кВт на місце", 0.93, 0.4),
            new DbnCommercialBuilding("Будівлі (приміщення) для науково-дослідних установ, проектних, управлінських, громадських організацій та культових будинків та споруд, адміністративні будинки промпідприємств з кондиціонуванням повітря", 50000, 0.055, "кВт на м2 корисної площі", 0.85, 0.62),
            new DbnCommercialBuilding("Будівлі (приміщення) для науково-дослідних установ, проектних, управлінських, громадських організацій та культових будинків та споруд, адміністративні будинки промпідприємств без кондиціонування повітря", 50000, 0.04, "кВт на м2 корисної площі", 0.9, 0.48),
            new DbnCommercialBuilding("Навчальні корпуси вищих, середніх спеціальних навчальних закладів (без їдалень) з кондиціонуванням повітря", 50000, 0.05, "кВт на м2 корисної площі", 0.9, 0.48),
            new DbnCommercialBuilding("Навчальні корпуси вищих, середніх спеціальних навчальних закладів (без їдалень) без кондиціонування повітря", 50000, 0.035, "кВт на м2 корисної площі", 0.92, 0.43),
            new DbnCommercialBuilding("Лабораторні корпуси вищих і середніх спеціальних навчальних закладів (без їдалень) з кондиціонуванням повітря", 50000, 0.07, "кВт на м2 корисної площі", 0.85, 0.62),
            new DbnCommercialBuilding("Лабораторні корпуси вищих і середніх спеціальних навчальних закладів (без їдалень) без кондиціонування повітря", 50000, 0.055, "кВт на м2 корисної площі", 0.87, 0.57),
            new DbnCommercialBuilding("Вбудовані нежитлові приміщення в житлових будинках при загальній площі до 2000 м2 включно", 2000, 0.15, "кВт на м2 корисної площі", 0.15, 0.62),
            new DbnCommercialBuilding("Вбудовані нежитлові приміщення в житлових будинках при загальній площі понад 2000 м2", 50000, 0.09, "кВт на м2 корисної площі", 0.09, 0.62),
            new DbnCommercialBuilding("Громадські будівлі багатофункціонального призначення", 50000, 0.08, "кВт на м2 корисної площі", 0.85, 0.62),
            new DbnCommercialBuilding("Гаражі (стоянки) індивідуального автотранспорту стаціонарні відкриті стоянки", 50000, 0.05, "кВт на місце", 0.9, 0.48),
            new DbnCommercialBuilding("Гаражі (стоянки) індивідуального автотранспорту закриті гаражі-бокси", 50000, 0.12, "кВт на місце", 0.9, 0.48),
            new DbnCommercialBuilding("Гаражі (стоянки) індивідуального автотранспорту закриті багатоповерхові та підземні гаражі", 50000, 0.22, "кВт на місце", 0.87, 0.57),
            };
            
        }

        public class DbnCommercialBuilding
        {
            public string TypeOfCommercial { get; set; }
            public double ValueOfCharacteristics { get; set; }
            public double SpecificActiveLoad { get; set; }
            public string MeasurmentUnit { get; set; }
            public double CosFi { get; set; }
            public double TgFi { get; set; }
            
       

            public DbnCommercialBuilding(string type, double valueOf, double load, string measurmentUnit, double cosFi, double tgFi)
            {
                TypeOfCommercial = type;
                ValueOfCharacteristics = valueOf;
                SpecificActiveLoad = load;
                MeasurmentUnit = measurmentUnit;
                CosFi = cosFi;
                TgFi = tgFi;
            }

           

        }

        
    }
}
